---
kind: property
id: P:Autodesk.Revit.DB.RadialArray.NumMembers
source: html/d2367107-a551-96ce-19b2-b96ef41678a7.htm
---
# Autodesk.Revit.DB.RadialArray.NumMembers Property

Retrieves or changes the number of the arrayed members.

## Syntax (C#)
```csharp
public override int NumMembers { get; set; }
```